scripts/org/my-js.org
#+TITLE: JS
#+AUTHOR: Shirishkumar Togarla
#+PROPERTY: header-args :tangle (f-expand (concat (f-base (buffer-file-name)) ".el") "../src")
* Package Initialization
#+begin_src elisp
;;; my-js.el --- Configuration to be loaded while starting emacs
;;; Commentary

;; The `my-js' package is used to load the required configuration
#+end_src
* Js2 mode
#+begin_src elisp
;; Js2-mode
(use-package js2-mode
  :ensure t
  :init
  (setq js-basic-indent 2)
  (setq-default js2-basic-indent 2
                js2-basic-offset 2
                js2-auto-indent-p t
                js2-cleanup-whitespace t
                js2-enter-indents-newline t
                js2-indent-on-enter-key t
                js2-global-externs (list "window" "module" "require" "buster" "sinon" "assert" "refute" "setTimeout" "clearTimeout" "setInterval" "clearInterval" "location" "__dirname" "console" "JSON" "jQuery" "$"))

  (add-hook 'js2-mode-hook
            (lambda ()
              (push '("function" . ?ƒ) prettify-symbols-alist)))

  (add-to-list 'auto-mode-alist '("\\.js$" . js2-mode)))
#+end_src
* color-identifiers-mode
#+begin_src elisp
;; color-identifiers-mode
(use-package color-identifiers-mode
    :ensure t
    :init
    (add-hook 'js2-mode-hook 'color-identifiers-mode))

(add-hook 'js2-mode-hook
          (lambda () (flycheck-select-checker "javascript-eslint")))
#+end_src
* Tern
#+begin_src elisp
;; tern
;; `NOTE' sudo npm -g install tern
;; (use-package tern
;;    :ensure t
;;    :init (add-hook 'js2-mode-hook (lambda () (tern-mode t)))
;;    :config
;;      (use-package company-tern
;;         :ensure t
;;         :init (add-to-list 'company-backends 'company-tern)))
#+end_src
* Js2 Refactor
#+begin_src elisp
;; js2-refactor
(use-package js2-refactor
  :ensure t
  :init   (add-hook 'js2-mode-hook 'js2-refactor-mode)
  :config (js2r-add-keybindings-with-prefix "C-c ."))
#+end_src
* SKewer Mode
#+begin_src elisp
;; skewer-mode
(use-package skewer-mode
   :ensure t
   :init (add-hook 'js2-mode-hook 'skewer-mode))
#+end_src
* Company Tern
#+begin_src elisp
;; Company tern
;; (use-package company-tern
;;   :ensure t
;;   :init
;;   (add-to-list 'company-backends 'company-tern))
#+end_src
* Js Comint
#+begin_src elisp
(use-package js-comint
  :ensure t)
#+end_src
* Package End
#+begin_src elisp
(provide 'my-js)

;;; my-js package ends here

#+end_src
